SET NAMES UTF8;
DROP DATABASE IF EXISTS wz;
CREATE DATABASE wz CHARSET UTF8;
USE wz;

/*首页轮播*/
CREATE TABLE wz_carousel(
	cid INT PRIMARY KEY AUTO_INCREMENT,
	img	VARCHAR(128),
	title	VARCHAR(64),
	href	VARCHAR(128),
	position		VARCHAR(32)
);

INSERT INTO wz_carousel VALUES
(NULL,'http://127.0.0.1:9000/img/swipe/2018053013464934216.jpg','轮播1','home/','home'),
(NULL,'http://127.0.0.1:9000/img/swipe/2018053013472054579.jpg','轮播2','home/','home'),
(NULL,'http://127.0.0.1:9000/img/swipe/2018102716362056020.jpg','轮播3','home/','home'),
(NULL,'http://127.0.0.1:9000/img/swipe/2018102716364161949.jpg','轮播4','home/','home');

/*首页主题：度假、戏剧艺术、会展*/
	tid INT PRIMARY KEY AUTO_INCREMENT,
	img_url VARCHAR(128),
	title VARCHAR(32),
	subtitle VARCHAR(64),
	href VARCHAR(128)
);

INSERT INTO wz_home_theme VALUES
(NULL,'http://127.1.0.1:9000/img/theme/2018033018522082156.jpg','度假','江南水乡，枕水人家。在乌镇享受精神和身体的完全放松','/vacation'),
(NULL,'http://127.1.0.1:9000/img/theme/2018033018500381211.jpg','戏剧文化','传统碰撞现代，在乌镇感受中国古老文化的非凡魅力和现代东方生活的融合','/culture'),
(NULL,'http://127.1.0.1:9000/img/theme/2018033018484799879.jpg','会展','乌镇以专业、高效、
CREATE TABLE wz_home_theme(谨慎的精神策划每一场活动让每一次盛典都成为人生独一无二的美好经历','/field');

/*主题类别*/
CREATE TABLE wz_theme_family(
	fid INT PRIMARY KEY AUTO_INCREMENT,
	tid INT,
	t_title VARCHAR(32),
	img_url VARCHAR(128),
	title VARCHAR(32),
	subtitle VARCHAR(128),
	href VARCHAR(128)
);
INSERT INTO wz_theme_family VALUES
(NULL,1,'度假乌镇','http://127.0.0.1:9000/img/theme_family/2018033014013581289.png','住宿','景区现有特色民宿、高档度假酒店、精品行馆等多家各具特色的酒店，可同时满足约3500人入住。酒店大都临河而建，环境优雅，独具一格，推窗而出，或许就与小桥流水的江南气息撞个满怀。','/vacation?id=0'),
(NULL,1,'度假乌镇','http://127.0.0.1:9000/img/theme_family/2018033014001336050.png','美食','乌镇，不仅是中国江南风景的精萃，也是美食的集中地。杭嘉湖地区特产丰美，繁华的乌镇一直不乏钟鸣鼎食之家。景区内百余家大小餐厅，可提供不同规模、风格、档次、特色的聚餐宴请，天南海北菜系缤纷，酸甜咸辣风味交融。无论是中餐、西餐，还是正式宴请、随意自助，古镇丰富的饮食文化将为您呈上江南味觉盛宴。','/vacation?id=1'),
(NULL,1,'度假乌镇','http://127.0.0.1:9000/img/theme_family/2018050511055533852.jpg','伴手礼','乌镇文化历史悠久，民间传统工艺精湛，独特的地理资源造就独具一格的传统手工艺品。乌镇自保护开发以来，除了传承传统文化，开发特色旅游产品外，还坚持本土化生产。众多特色产品不仅纯天然、绿色环保、包装精美，更富有文化气息。','/vacation?id=2'),
(NULL,1,'度假乌镇','http://127.0.0.1:9000/img/theme_family/2018033014025180246.png','休闲娱乐','在乌镇西栅，总有那么一个美妙的地方，适合您与伙伴共同徜徉在此。或许是曼妙朦胧的水上夜游，茗香四溢的休闲茶艺；又或者是激情四溢的酒吧狂欢，为健康加油的水疗养生；如果正好遇上乌镇的缤纷节日，更让您沉醉于江南的独特魅力。人生不尽是紧张的工作，生活需要多彩的节奏。','/vacation?id=3'),
(NULL,1,'度假乌镇','http://127.0.0.1:9000/img/theme_family/2018052509203842018.jpg','乌村','乌村，位于乌镇西栅历史街区北侧500米，系紧依京杭大运河而立的传统村落，总面积450亩。是一个以田园风光为主题，用“休闲度假村落”的方法打造的高端乡村旅游度假区。 乌村颠覆中国乡村游的传统模式，采用一价全包的套餐式体验，一键预订即可打包吃住行和20多项免费体验项目，不带钱包轻松畅游，像个农人采菱、捉虾、捕鱼、下地……做一个自给自足的现代乡下人。','/vacation?id=4');

CREATE TABLE wz_family_class(
	cid INT PRIMARY KEY AUTO_INCREMENT,
	tid INT,
	fid INT,
	title VARCHAR(32)
);
INSERT INTO wz_family_class VALUES
(NULL,1,1,'度假酒店'),
(NULL,1,1,'精品酒店'),
(NULL,1,1,'乌镇民宿'),
(NULL,1,1,'青年旅馆'),
(NULL,1,1,'经济酒店'),
(NULL,1,2,'特色菜'),
(NULL,1,2,'特色小吃'),
(NULL,1,2,'餐饮名店'),
(NULL,1,3,'伴手礼'),
(NULL,1,4,'休闲娱乐'),
(NULL,1,4,'传统特色'),
(NULL,1,5,'乌村');


/*主题类别选项*/
CREATE TABLE wz_theme_holiday(
	hid INT PRIMARY KEY AUTO_INCREMENT,
	tid INT,
	fid INT,
	cid INT,
	img_url VARCHAR(128),
	title VARCHAR(32),
	subtitle VARCHAR(128),
	href VARCHAR(128)
);

INSERT INTO wz_theme_holiday VALUES
(NULL,1,1,'1','http://127.0.0.1:9000/img/zhusu/2017090814015687223.png','枕水度假酒店','',''),
(NULL,1,1,'1','http://127.0.0.1:9000/img/zhusu/2018042413260813239.jpg','昭明书舍','',''),
(NULL,1,1,'1','http://127.0.0.1:9000/img/zhusu/2017102516530896123.jpg','水巷驿','',''),
(NULL,1,1,'1','http://127.0.0.1:9000/img/zhusu/2018052311260733851.jpg','通安客栈','',''),
(NULL,1,1,'1','http://127.0.0.1:9000/img/zhusu/2018082915263181818.jpg','水市客舍','',''),
(NULL,1,1,'2','http://127.0.0.1:9000/img/zhusu/2018033015383154835.jpg','宜园精品酒店','',''),
(NULL,1,1,'2','http://127.0.0.1:9000/img/zhusu/2017102517302129836.jpg','锦堂行馆','',''),
(NULL,1,1,'2','http://127.0.0.1:9000/img/zhusu/2017102517410161201.jpg','望津里精品酒店','',''),
(NULL,1,1,'2','http://127.0.0.1:9000/img/zhusu/2017102517340447842.jpg','盛庭行馆','',''),
(NULL,1,1,'2','http://127.0.0.1:9000/img/zhusu/2017102517362370840.jpg','恒益堂行馆','',''),
(NULL,1,1,'3','http://127.0.0.1:9000/img/zhusu/2017102517440063092.jpg','','乌镇民宿沿西栅市河蜿蜒而布，由乌镇具有百年历史的民居改建而成。客房或面水，或临街，推窗可赏江南水乡秀丽风光，出门可跨入绵延的西栅大街',''),
(NULL,1,1,'4','http://127.0.0.1:9000/img/zhusu/2018100716115220027.jpg','子夜酒店','',''),
(NULL,1,1,'4','http://127.0.0.1:9000/img/zhusu/2018112415521712350.jpg','乌镇青年驿站','',''),
(NULL,1,1,'4','http://127.0.0.1:9000/img/zhusu/2017092815102564991.png','两府客栈','',''),
(NULL,1,1,'4','http://127.0.0.1:9000/img/zhusu/2017092815182654880.png','林家客栈','',''),
(NULL,1,1,'4','http://127.0.0.1:9000/img/zhusu/2018100716115220027.jpg','南栅客栈','',''),
(NULL,1,1,'5','http://127.0.0.1:9000/img/zhusu/2017092815354729823.png','水巷青年旅馆','',''),
(NULL,1,1,'5','http://127.0.0.1:9000/img/zhusu/2017092815501478476.png','紫藤青年旅馆','',''),
(NULL,1,2,'6','http://127.0.0.1:9000/img/meishi/2017090614431275845.png','抱腌太湖白水鱼','',''),
(NULL,1,2,'6','http://127.0.0.1:9000/img/meishi/2018060409194450760.png','桂花糖醋小排','',''),
(NULL,1,2,'6','http://127.0.0.1:9000/img/meishi/2018060409374757996.jpg','外婆私房菜','',''),
(NULL,1,2,'6','http://127.0.0.1:9000/img/meishi/2018042413472561603.jpg','红烧羊肉','',''),
(NULL,1,2,'6','http://127.0.0.1:9000/img/meishi/2018060409155375680.png','乌酒小牛肉','',''),
(NULL,1,2,'6','http://127.0.0.1:9000/img/meishi/2018060409244946002.png','夹饼宝塔肉','',''),
(NULL,1,2,'6','http://127.0.0.1:9000/img/meishi/2017090614470284757.png','酱鸭','',''),
(NULL,1,2,'6','http://127.0.0.1:9000/img/meishi/2018060409232466839.png','碎蒸太湖桂花鱼','',''),
(NULL,1,2,'7','http://127.0.0.1:9000/img/meishi/2017101214021345191.jpg','青团','',''),
(NULL,1,2,'7','http://127.0.0.1:9000/img/meishi/2017102014380366944.jpg','熏豆茶','',''),
(NULL,1,2,'7','http://127.0.0.1:9000/img/meishi/2017102014430698328.jpg','定胜糕','',''),
(NULL,1,2,'7','http://127.0.0.1:9000/img/meishi/2017102014454311860.jpg','萝卜丝饼','',''),
(NULL,1,2,'7','http://127.0.0.1:9000/img/meishi/2017122810172174693.jpg','白三酒','',''),
(NULL,1,2,'7','http://127.0.0.1:9000/img/meishi/2017102014525866848.jpg','姑嫂饼','',''),
(NULL,1,2,'7','http://127.0.0.1:9000/img/meishi/2018042411012826969.jpg','船头粽','',''),
(NULL,1,2,'7','http://127.0.0.1:9000/img/meishi/2017122716462727197.jpg','筒骨粥','',''),
(NULL,1,2,'7','http://127.0.0.1:9000/img/meishi/2017122810244735888.jpg','吴妈混沌','',''),
(NULL,1,2,'7','http://127.0.0.1:9000/img/meishi/2017122812055343197.jpg','桂花方糕','',''),
(NULL,1,2,'8','http://127.0.0.1:9000/img/meishi/2017092917535250686.jpg','枕水芙蓉中餐厅','',''),
(NULL,1,2,'8','http://127.0.0.1:9000/img/meishi/2017093016105918873.jpg','枕水水莲西餐厅','',''),
(NULL,1,2,'8','http://127.0.0.1:9000/img/meishi/2017092917383985907.jpg','通安中餐厅','',''),
(NULL,1,2,'8','http://127.0.0.1:9000/img/meishi/2018033010361571358.jpg','明徽餐厅','',''),
(NULL,1,2,'8','http://127.0.0.1:9000/img/meishi/2018042410330294812.jpg','水阁餐厅','',''),
(NULL,1,2,'8','http://127.0.0.1:9000/img/meishi/2018033010322756347.jpg','淡茶饭-国际互联网宴请餐厅','',''),
(NULL,1,2,'8','http://127.0.0.1:9000/img/meishi/2017093015355072861.jpg','民国时代','',''),
(NULL,1,2,'8','http://127.0.0.1:9000/img/meishi/2017092917500547855.jpg','锦岸私房菜','',''),
(NULL,1,2,'8','http://127.0.0.1:9000/img/meishi/2017093015491526446.jpg','京杭河鲜馆','',''),
(NULL,1,2,'8','http://127.0.0.1:9000/img/meishi/2017093015520730448.jpg','水巷驿中餐厅','',''),
(NULL,1,2,'8','http://127.0.0.1:9000/img/meishi/2017092917471694975.jpg','将军府火锅','',''),
(NULL,1,2,'8','http://127.0.0.1:9000/img/meishi/2017093016051395319.jpg','枕水碧波廊餐厅','',''),
(NULL,1,3,'9','http://127.0.0.1:9000/img/banshouli/2017090815281691417.png','乌锦','',''),
(NULL,1,3,'9','http://127.0.0.1:9000/img/banshouli/2017093016335671367.jpg','叙昌酱品','',''),
(NULL,1,3,'9','http://127.0.0.1:9000/img/banshouli/2018042015384687916.jpg','蚕丝被','',''),
(NULL,1,3,'9','http://127.0.0.1:9000/img/banshouli/2017093016264727797.jpg','蓝印花布','',''),
(NULL,1,3,'9','http://127.0.0.1:9000/img/banshouli/2018042413562382023.jpg','亦昌铁器','',''),
(NULL,1,3,'9','http://127.0.0.1:9000/img/banshouli/2018042313404475087.jpg','乌镇白菊','',''),
(NULL,1,3,'9','http://127.0.0.1:9000/img/banshouli/2018052414493454988.jpg','三百酒','',''),
(NULL,1,3,'9','http://127.0.0.1:9000/img/banshouli/2018052414461140930.jpg','乌酒','',''),
(NULL,1,3,'9','http://127.0.0.1:9000/img/banshouli/2017093016490979926.jpg','乌香','',''),
(NULL,1,3,'9','http://127.0.0.1:9000/img/banshouli/2018052414560181693.jpg','糕点','',''),
(NULL,1,3,'9','http://127.0.0.1:9000/img/banshouli/2017093016564465621.jpg','本草乌茶','',''),
(NULL,1,3,'9','http://127.0.0.1:9000/img/banshouli/2017093016584549053.jpg','竹木工艺','',''),
(NULL,1,3,'9','http://127.0.0.1:9000/img/banshouli/2018052415020024894.jpg','丝绸','',''),
(NULL,1,4,'10','http://127.0.0.1:9000/img/xiuxian/2017092618264043206.png','洛神Spa水疗养生馆','',''),
(NULL,1,4,'10','http://127.0.0.1:9000/img/xiuxian/2017101211433681445.jpg','咖啡吧','',''),
(NULL,1,4,'10','http://127.0.0.1:9000/img/xiuxian/2017101211014781747.jpg','酒吧','',''),
(NULL,1,4,'11','http://127.0.0.1:9000/img/xiuxian/2018050513244689901.jpg','节日','',''),
(NULL,1,4,'11','http://127.0.0.1:9000/img/xiuxian/2017101016041626306.jpg','东栅景区传统体验','',''),
(NULL,1,4,'11','http://127.0.0.1:9000/img/xiuxian/2018050513101712117.jpg','西栅景区传统体验','',''),
(NULL,1,5,'12','http://127.0.0.1:9000/img/wucun/1527580530610311.jpg','','',''),
(NULL,1,5,'12','http://127.0.0.1:9000/img/wucun/1527580372407215.jpg','','',''),
(NULL,1,5,'12','http://127.0.0.1:9000/img/wucun/1527580478769356.jpg','','',''),
(NULL,1,5,'12','http://127.0.0.1:9000/img/wucun/1527580489422095.jpg','','',''),
(NULL,1,5,'12','http://127.0.0.1:9000/img/wucun/1527580571541174.jpg','','',''),
(NULL,1,5,'12','http://127.0.0.1:9000/img/wucun/1527580599145912.jpg','','',''),
(NULL,1,5,'12','http://127.0.0.1:9000/img/wucun/1527580836544425.jpg','','',''),
(NULL,1,5,'12','http://127.0.0.1:9000/img/wucun/1527580642558265.jpg','','','');

CREATE TABLE wz_user(
  uid INT PRIMARY KEY AUTO_INCREMENT,
  uname VARCHAR(32),
  upwd VARCHAR(32),
  email VARCHAR(64),
  phone VARCHAR(16),
  avatar VARCHAR(128),        #头像图片路径
  user_name VARCHAR(32),      #用户名，如王小明
  gender INT                  #性别  0-女  1-男
);
/**用户信息**/
INSERT INTO wz_user VALUES
(NULL, 'dingding', '123456', 'ding@qq.com', '13501234567', 'img/avatar/default.png', '丁伟', '1'),
(NULL, 'dangdang', '123456', 'dang@qq.com', '13501234568', 'img/avatar/default.png', '林当', '1'),
(NULL, 'doudou', '123456', 'dou@qq.com', '13501234569', 'img/avatar/default.png', '窦志强', '1'),
(NULL, 'yaya', '123456', 'ya@qq.com', '13501234560', 'img/avatar/default.png', '秦小雅', '0');

CREATE TABLE wz_traver_tour(
	rid INT PRIMARY KEY AUTO_INCREMENT,
	t_title VARCHAR(32),
	f_title VARCHAR(32),
	img_url VARCHAR(128),
	title VARCHAR(32),
	subtitle VARCHAR(128),
	content VARCHAR(128)
);
INSERT INTO wz_traver_tour VALUES
(NULL,'出行锦囊','游记攻略','http://127.0.0.1:9000/img/youji/2018081214103528224.jpg','【乌镇乌村】 回归自然，走进古韵，寻找喧嚣中的那片宁静','2018.07.27     朋友出行,水乡风貌','乌镇的乌村是近两年新开的度假地，返璞归真的农家生活吸引了很多呆腻了大城市的都市人，于是我们开启了三天两晚的乌镇度假模式。'),
(NULL,'出行锦囊','游记攻略','http://127.0.0.1:9000/img/youji/2018060808360950828.jpg','端午节出游完全指南，三天玩转一个村还有一个镇','2018.06.08     朋友出行，历史文化,水乡风貌','五一小长假一别，转眼就要到端午了。五月初五端午节，赛龙舟，吃粽子，纪念屈原。在乌镇，端午节又会是什么样子的呢？'),
(NULL,'出行锦囊','游记攻略','http://127.0.0.1:9000/img/youji/2018051410033969828.png','乌村 | 过腻了城市的喧嚣，我来这里归于宁静','2017.12.23     个人游,休闲周末',' 迷失自己，然后找到自己，出走，归来，才真正明白幸福的意义是什么。'),
(NULL,'出行锦囊','游记攻略','http://127.0.0.1:9000/img/youji/2018042515202564381.jpg','随手收藏，史上最全，教你如何玩透乌镇。','2017.4.26     深度游,朋友出行','五一小长假即将来临，旅行再一次成为热议的话题。于是，去哪儿，哪儿好玩，怎么玩，住哪里，怎么做攻略成为大家搜索网络的关键词。'),
(NULL,'出行锦囊','游记攻略','http://127.0.0.1:9000/img/youji/2018042516065538127.jpg','  乌村两日亲子游记：周末遛娃去哪？田园乌村等你来','2017.9.14     家庭游,休闲周末','当然身处城市，想找一方适合溜娃的田园之地，并非易事，当我说去乌村之际，很多朋友，甚至连宝爸都一头雾水，也许你我都耳熟能详乌镇之名，似水年华的乌镇是很多人心中的江南幽梦，近年来召开的互联网大会更是让乌镇声名远播，调侃去乌镇邂逅习大大和马云爸爸是网络上流传甚广的段子。'),
(NULL,'出行锦囊','游记攻略','http://127.0.0.1:9000/img/youji/2018042516170997482.jpg','乌镇 | 来一场毕业旅行，再给青春一个留影的机会','2017.6.24     团体游，水乡风貌、历史文化','这两天，高考成绩已经陆陆续续的出来了，不少拿到成绩的小伙伴，已经准备报考完来一场说走就走的旅行！'),
(NULL,'出行锦囊','游记攻略','http://127.0.0.1:9000/img/youji/2018051410281831322.png','戏剧节攻略 | 如何在乌镇度过完美两天一夜的戏剧狂欢~','2017.09.09     朋友出行,二日游','十月将近，戏剧节都在眼前了。'),
(NULL,'出行锦囊','游记攻略','http://127.0.0.1:9000/img/youji/2018051411073698466.png','攻略 | 暑假带孩子出游是怎样一种体验','2017.08.09     二日游,乌村','现如今，越来越多的家长行程单里，多了一项暑期带孩子出游的计划，趁着长长的假期，全家一起出游，既是增加亲子陪伴的时间，也是放松的一个好方式。'),
(NULL,'出行锦囊','游记攻略','http://127.0.0.1:9000/img/youji/2018051413311241880.png','一人行 | 一场秋雨一场寒，年年单身愁断肠','2017.11.11     水乡风貌,一日游',''),
(NULL,'出行锦囊','游记攻略','http://127.0.0.1:9000/img/youji/2018051415040365305.png','一贴包治乌镇吃住行 | 国庆中秋小长假','2017.09.27     团体游,历史文化','十一小长假已经在眼前了，本年度最长的一个假期，小乌已经收到了许许多多的提问。根据提问的内容着重做了这一份攻略。'),
(NULL,'出行锦囊','游记攻略','http://127.0.0.1:9000/img/youji/2018071513104823084.jpg','如果最后是你，那我等 | 乌镇·婚礼','2018.03.14     水乡婚礼,西式婚礼,中式婚礼','黑瓦白墙，石桥流水，运河旁站立了千年的小镇，一直就是个适合结婚的地方。'),
(NULL,'出行锦囊','游记攻略','http://127.0.0.1:9000/img/youji/2018071514111650922.jpg','关于乌镇婚礼的N种可能 | 乌镇·婚礼','2017.09.11     乌镇婚礼,水乡婚礼','用一场绝美的婚礼来开启余生的甜腻啊~');

